WebContent/consulta-soap.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<sobre xmlns="http://valida.aem.gob.cl">
			<encabezado>
				<idSobre>123456789</idSobre>
				<fechaHora>2010-11-08T14:14:26.957Z</fechaHora>
				<proveedor>
					<nombre>DIPRECA</nombre>
					<servicios>
						<servicio>IMPONENTES DIPRECA</servicio>
						<respuestaServicio>
							<estado>ESTADO GLOSA 2</estado>
							<glosa>GLOSA 2</glosa>
						</respuestaServicio>
					</servicios>
				</proveedor>
				<consumidor>
					<nombre>IPS</nombre>
					<tramite>SISTEMA PENSION SOLIDARIA</tramite>
					<certificado>
						<ns1:X509Data xmlns:ns1="http://www.w3.org/2000/09/xmldsig#">
							<ns1:X509IssuerSerial>
								<ns1:X509IssuerName>IN</ns1:X509IssuerName>
								<ns1:X509SerialNumber>0</ns1:X509SerialNumber>
							</ns1:X509IssuerSerial>
						</ns1:X509Data>
					</certificado>
				</consumidor>
				<fechaHoraReq>2010-11-08T14:14:26.957Z</fechaHoraReq>
				<metadataOperacional>
					<estadoSobre>00</estadoSobre>
					<glosaSobre>GLOSA SOBRE AQUI</glosaSobre>
				</metadataOperacional>
			</encabezado>
			<cuerpo>
				<documento>
					<ns2:EntradaDatosImponente xmlns:ns2="http://servicios.dipreca.cl/ipsV01">
						<ns2:RutIPS>
							<numero>4895102</numero>
							<dv>3</dv>
						</ns2:RutIPS>
					</ns2:EntradaDatosImponente>
				</documento>
			</cuerpo>
		</sobre>
	</soapenv:Body>
</soapenv:Envelope>